app/Http/Controllers/SeriesController.php

    public function destroy(Series $series)
    {
        $series->delete();
---
delete from "series" where "id" = 2